// 1~10 1씩 증가 반복문 while문
let i=0;
while(i<10){ //조건이 만족하는 동안 반복
    i++; //1 2 ...8 9 10
    console.log(i);
}
// 선생님 曰
// for문과 다른 점은 시작 초기 설정값과 종료값을 정해야한다.
// while문은 for문보다 머리 회전 2~3배 더 들어간다.
// 프로그램 짤 때 머리 많이 쓰는 것이 '리액트' 리액트 사용하기 시작하면, 머리가 좋아짐을 느낄 수 있다. '리액트 > 뷰'
// 한번 사용한 변수는 재정의 불가능 
// 변수의 값만 바꾸면 된다.

//결과
// 1
// 2
// 3
// 4
// 5
// 6
// 7
// 8
// 9
// 10

// 10~1 1씩 감소 반복문 while문
i =10; // 10 9 8 ....2 1 
// while(i>=2)
while(i>1){ //2
    i--; // 10 9 8 ....2 1 
    console.log(i);
}

//결과
// 10
// 9
// 8
// 7
// 6
// 5
// 4
// 3
// 2
// 1

