package homework;

public class H01_java_다이아몬드_알고리즘_구현 {

	public static void main(String[] args) {
		//다이아몬드 알고리즘 구현
		//7행 7열
		//알고리즘 분석  
		//1행 들여쓰기 3칸 카운트 1
		//2행 들여쓰기 2칸 카운트 3
		//3행 들여쓰기 1칸 카운트 5
		//4행 들여쓰기 0칸 카운트 7   ---> 센터
		//5행 들여쓰기 1칸 카운트 5	
		//6행 들여쓰기 2칸 카운트 3	
		//7행 들여쓰기 3칸 카운트 1	
		//예시]
/*				1
 * 			2	3	4
 * 		5	6	7	8	9
 * 	10	11	12	13	14	15	16	
 * 		17	18	19	20	21
 * 			22	23	24
 * 				25
 */
		
		int cnt=0;
		int step=-1;
		int end;  //end값 선언
		
		for(int i=1; i<=7; i++) { // 7줄(행)
			
			if(i<=4) { 
				step+=2;
				end =4-i;
				
			}
			else {
				step-=2;
				end =i-4;
			}
			
			
			//1.들여쓰기 
			//1행(4-i(1)=3) 2행( 4-i(2)=2) 3행(4-i(3)=1)  4행 (4-i(4)=0)
			//else 5행  ( (i)5-4=1) 6행((i)6-4 =2)  7행 ((i)7-4 =2)
			for(int j=1; j<=end; j++) {
				System.out.printf("%3s", "");
			}
			//2.카운트 증가 
			// step  1행  (초기화값 -1)+(+2) =1 / 2행  1+(+2) =3 /3행 3+(+2) =5 /4행 5+(+2)=7    
			// else 5행(7-2=5)6행 (5-2=3)7행 (3-2=1)
			for(int j=1; j<=step; j++) {
				cnt++;
				System.out.printf("%2d ", cnt);
			}
			System.out.println();
		}
	}

}
